backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 28, 28, 1]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [3, 3]
      name: conv2d_1
      padding: same
      strides: &id007 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id008 !!python/tuple [3, 3]
      name: conv2d_2
      padding: same
      strides: &id009 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - &id002 {}
      - - conv2d_2
        - 0
        - 0
        - *id002
    name: concatenate_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Activation
    config: {activation: relu, name: activation_2, trainable: true}
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id011 !!python/tuple [3, 3]
      name: conv2d_3
      padding: same
      strides: &id012 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - &id003 {}
      - - conv2d_3
        - 0
        - 0
        - *id003
    name: concatenate_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Activation
    config: {activation: relu, name: activation_3, trainable: true}
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id014 !!python/tuple [3, 3]
      name: conv2d_4
      padding: same
      strides: &id015 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_3, trainable: true}
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - &id004 {}
      - - conv2d_4
        - 0
        - 0
        - *id004
    name: concatenate_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: Activation
    config: {activation: relu, name: activation_4, trainable: true}
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 124
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id017 !!python/tuple [3, 3]
      name: conv2d_5
      padding: same
      strides: &id018 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: Activation
    config: {activation: relu, name: activation_5, trainable: true}
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 124
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id019 !!python/tuple [3, 3]
      name: conv2d_6
      padding: same
      strides: &id020 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_1
      padding: valid
      pool_size: &id005 !!python/tuple [2, 2]
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: conv2d_7
      padding: same
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: conv2d_8
      padding: same
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_4, trainable: true}
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - &id010 {}
      - - conv2d_8
        - 0
        - 0
        - *id010
    name: concatenate_4
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: Activation
    config: {activation: relu, name: activation_7, trainable: true}
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: conv2d_9
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_5, trainable: true}
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - &id013 {}
      - - conv2d_9
        - 0
        - 0
        - *id013
    name: concatenate_5
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: Activation
    config: {activation: relu, name: activation_8, trainable: true}
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id014
      name: conv2d_10
      padding: same
      strides: *id015
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_6, trainable: true}
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - &id016 {}
      - - conv2d_10
        - 0
        - 0
        - *id016
    name: concatenate_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_6
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: Activation
    config: {activation: relu, name: activation_9, trainable: true}
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 124
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id017
      name: conv2d_11
      padding: same
      strides: *id018
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: Activation
    config: {activation: relu, name: activation_10, trainable: true}
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 124
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id019
      name: conv2d_12
      padding: same
      strides: *id020
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_2
      padding: valid
      pool_size: *id005
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - conv2d_12
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: conv2d_13
      padding: same
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: conv2d_14
      padding: same
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: conv2d_14
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_7, trainable: true}
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - &id021 {}
      - - conv2d_14
        - 0
        - 0
        - *id021
    name: concatenate_7
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_7
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: Activation
    config: {activation: relu, name: activation_12, trainable: true}
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: conv2d_15
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_12
        - 0
        - 0
        - {}
    name: conv2d_15
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_8, trainable: true}
    inbound_nodes:
    - - - concatenate_7
        - 0
        - 0
        - &id022 {}
      - - conv2d_15
        - 0
        - 0
        - *id022
    name: concatenate_8
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_8
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: Activation
    config: {activation: relu, name: activation_13, trainable: true}
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id014
      name: conv2d_16
      padding: same
      strides: *id015
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_13
        - 0
        - 0
        - {}
    name: conv2d_16
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_9, trainable: true}
    inbound_nodes:
    - - - concatenate_8
        - 0
        - 0
        - &id023 {}
      - - conv2d_16
        - 0
        - 0
        - *id023
    name: concatenate_9
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_14
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_9
        - 0
        - 0
        - {}
    name: batch_normalization_14
  - class_name: Activation
    config: {activation: relu, name: activation_14, trainable: true}
    inbound_nodes:
    - - - batch_normalization_14
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 124
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id017
      name: conv2d_17
      padding: same
      strides: *id018
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_14
        - 0
        - 0
        - {}
    name: conv2d_17
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_15
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_17
        - 0
        - 0
        - {}
    name: batch_normalization_15
  - class_name: Activation
    config: {activation: relu, name: activation_15, trainable: true}
    inbound_nodes:
    - - - batch_normalization_15
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 124
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id019
      name: conv2d_18
      padding: same
      strides: *id020
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_15
        - 0
        - 0
        - {}
    name: conv2d_18
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_3
      padding: valid
      pool_size: *id005
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - conv2d_18
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: Flatten
    config: {data_format: channels_last, name: flatten_1, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: flatten_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - flatten_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 10
      use_bias: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dense_2
  name: model_1
  output_layers:
  - [dense_2, 0, 0]
keras_version: 2.2.4
